package com.example.finaluri

object setData {
    fun SetPlanets():List<PlanetData>{
        var Planetlist= mutableListOf<PlanetData>()
        Planetlist.add(
            PlanetData(
                1,
                "მარსი",
                "ირმის ნახტომი",
                "227.9",
                "3.721",
                "მარსი მეოთხე პლანეტაა სიშორითა და მერკურის შემდეგ, ზომით ყველაზე მცირე პლანეტა მზის სისტემაში. მას რომაული ომის ღმერთის მარსის სახელი ჰქვია. მარსს მეტსახელად ”წითელ პლანეტასაც” უწოდებენ, მისი ზედაპირის მოწითალო შეფერილობის გამო, რაც მაგემიტის (რკინის ოქსიდის) დიდი რაოდენობითაა გამოწვეული.\n მარსი დედამიწის ჯგუფის პლანეტებს მიეკუთვნება, მისი ატმოსფერო გაიშვიათებულია (დედამიწასთან შედარებით წნევა მარსის ზედაპირზე 160-ჯერ მცირეა). პლანეტის რელიეფის თავისებურებას წარმოადგენს: მთვარის მსგავსი კრატერები (ისინი მეტეორიტებთან შეჯახებითაა გამოწვეული), ვულკანები, უდაბნოები, ხეობები და დედამიწის მსგავსი პოლარული ყინულის ქუდები.\n მარსს ორი ბუნებრივი თანამგზავრი გააჩნია - ფობოსი და დეიმოსი (ბერძნულიდან, \"შიში\" და \"საშინელება\", არესის შვილების სახელებია, რომლებიც ომის დროს მუდამ მის გვერდით იმყოფებიან). ორივე თანამგზავრი მცირე ზომისაა და უსწორმასწორო ზედაპირი გააჩნია.\n მარსის ასტრონომიული სიმბოლოა ♂, რომელიც ანტიკური ღმერთი მარსის შუბისა და ფარის სიმბოლოა."
            )
        )
        Planetlist.add(
            PlanetData(
                2,
                "მთვარე",
                "ირმის ნახტომი",
                "150.0",
                "1.62",
                "მთვარე დედამიწის ერთადერთი ბუნებრივი თანამგზავრია. მზის სისტემის ერთ-ერთი უდიდესი ბუნებრივი თანამგზავრი, და უდიდესი თანამგზავრებს შორის ზომის შეფარდებით იმ პლანეტასთან, რომლის გარშემოც ისინი ბრუნავენ. აგრეთვე, დღეს ცნობილი თანამგზავრების სიმკვრივეებს შორის, ის ამ მაჩვენებლით მეორეა (იუპიტერის თანამგზავრ იოს შემდეგ). მას რაიმე ფორმალური სახელი გარდა მთვარისა არ გააჩნია, თუმცა ზოგადად მეცნიერულ შრომებში მას „ლუნა“-დაც მოიხსენიებენ (ლათ. Luna). მისი სიმბოლოა ნახევარმთვარე. მთვარის საშუალო სიშორე დედამიწიდან 384 000კმ-ია. დიამეტრი 3 476 კმ-ია.\n მთვარე ბნელი და ცივი, „ბრმა“ ციური სხეულია, რომელიც მზისგან არეკლილი სინათლით ანათებს, იგი მზიდან გამოსხივებული სინათლის მხოლოდ 7%-ს ირეკლავს.\n პირველი ხელოვნური ობიექტი, რომელიც მთვარეზე დაეშვა იყო „ლუნა 2“ (1959). პირველი ფოტოსურათები მთვარის დედამიწისგან მოფარებულ მხარეს გადაიღო „ლუნა 3“-მა იმავე წელს. პირველი ადამიანები, რომლებმაც მთვარეზე დადგეს ფეხი იყვნენ ხომალდიდან „აპოლო 11“ (აშშ, 1969)."
            )
        )
        Planetlist.add(
            PlanetData(
                3,
                "ნეპტუნი",
                "ირმის ნახტომი",
                "4497.1",
                "11.15",
                "ნეპტუნი სიშორით მერვე პლანეტა მზიდან და ყველაზე შორეული გაზის გიგანტი ჩვენს მზის სისტემაში. ნეპტუნი სიდიდით მესამე პლანეტაა (დიამეტრით მეოთხე). ნეპტუნის ატმოსფერო შედგება 90 % წყალბადისგან, 19 % ჰელიუმისგან და 1 % სხვა აირებისგან. მისი ეკვატორული დიამეტრი 49 500 კმ-ია, ხოლო პოლარული დიამეტრი 48 700 კმ. მზის ირგვლივ ერთ ბრუნს 164 წელს 9 თვეს და 15 დღეს ანდომებს. ნეპტუნს ასევე ახასიათებს 2.100 კმ/სთ სიჩქარის წყალბადის, ჰელიუმისა და მეთანის ქარები, რაც მას ლურჯ შეფერილობას აძლევს. მას 13 თანამგზავრი ჰყავს. მისი უდიდესი თანამგზავრი ტრიტონი გამოირჩევა რეტროგრადული ორბიტით, ექსტრემალურად ცივია -235 °C (38 °K) და მას ექსტრემალურად შეკუმშული ატმოსფერო აქვს.\\n პლანეტას რომაული ღმერთი ნეპტუნის სახელი ჰქვია მისი ლურჯი მეთანის ღრუბლების გამო. მისი ასტრონომიული სიმბოლო ღმერთის სამკაპის ნიშნის სტილიზებული ვერსიაა (♆).\n პლანეტა აღმოჩენილ იქნა 1846 წლის 23 სექტემბერს და დღემდე მას მხოლოდ ერთი ხომალდი ვოიაჯერ 2 ეწვია, რომელმაც მის გასწვრივ 1989 წლის 25 აგვისტოს ჩაიფრინა."
            )
        )
        Planetlist.add(
            PlanetData(
                4,
                "დედამიწა",
                "ირმის ნახტომი",
                "149.6",
                "9.807",
                "დედამიწა მზის სისტემაში მზიდან მესამე პლანეტა. იგი უდიდესია დედამიწის ტიპის პლანეტებს შორის და სამყაროში ცნობილი ერთადერთი ადგილია, რომელიც დასახლებულია ცოცხალი არსებებით. დედამიწის ზედაპირის უდიდესი ნაწილი წყალს უკავია, მის გარშემო კი ჰაერის გარსი - ატმოსფეროა. იგი დაახლოებით 4,3 მილიარდი წლის წინ წარმოიქმნა და მალევე შეიძინა თავისი ერთადერთი ბუნებრივი თანამგზავრი მთვარე. აგრეთვე დღემდე აღმოჩენილია რამდენიმე კვაზითანამგზავრი. 2015 წლის ბოლო მონაცემებით დედამიწაზე 7,6 მილიარდი ადამიანი ცხოვრობს.\n დედამიწის ასაკის დადგენა ისეთივე რთული პრობლემაა, როგორც მისი წარმოშობის მექანიზმისა. მეცნიერებმა უკანასკნელი ხუთი ათწლეულის განმავლობაში ფიზიკის მიღწევების გამოყენებით სცადეს ქანების ასაკი დაედგინათ, რისი საშუალებითაც შესაძლებელია დედამიწის ასაკის განსაზღვრაც. გამოანგარიშებულია, რომ დედამიწა დაახლოებით 5, ხოლო ქერქი 4,5 მილიარდი წლის წინ წარმოიქმნა.\n სიცოცხლის არსებობის პირველი ნიშნები დედამიწაზე მხოლოდ 3-3,5 მილიარდი წლის წინ გაჩნდა. მკვლევართა აზრით ჩვენს პლანეტაზე სიცოცხლის გაჩენის ორი გზა არსებობს: კოსმოსური და დედამიწისეული. კოსმოსური გზის მიხედვით სიცოცხლე დედამიწაზე სხვა ციური სხეულებიდან მოხვდა."
            )
        )
        Planetlist.add(
            PlanetData(
                5,
                "ვენერა",
                "ირმის ნახტომი",
                "108.2",
                "8.87",
                "ვენერა მეორე პლანეტაა მზიდან და მას ხშირად დედამიწის დობილს უწოდებენ, ვინაიდან ორივე ციური სხეული ერთმანეთს საკმაოდ ემსგავსება სიდიდითა და შემადგენლობით. პლანეტას რომაელი სიყვარულის ქალღმერთის ვენერას სახელი ჰქვია.\n ვენერა დედამიწას ყველა სხვა პლანეტაზე მეტად უახლოვდება ხოლმე. ეძახიან ”მწუხრის ვარსკვლავსაც”” და ”ცისკრის ვარსკვლავსაც””, რადგან მისი დანახვა ხან დაისის შემდეგ შეიძლება, ხან განთიადის წინ. იგი იმდენად ნათელი და კაშკაშაა, ხშირად ამოუცნობი მფრინავი ობიექტი (ამო, ”მფრინავი თეფში”) ჰგონიათ. ვენერას თეთრი ღრუბლების სქელი ფენა ფარავს. ზედაპირზე ტემპერატურა 470 ºC-ს აღწევს. მასზე ნაკლებადაა კოსმოსური სხეულის ნაკვალევი - კრატერები, რადგან კოსმოსური სხეულები უმეტესწილად ვენერას ატმოსფეროში შეჭრისთანავე იწვის მისი დიდი სიმკვრივის გამო. ზედაპირი დაფარულია ”ბებერი” ვულკანებითა და ლავით."
            )
        )
        Planetlist.add(
            PlanetData(
                6,
                "ურანი",
                "ირმის ნახტომი",
                "2871.0",
                "8.87",
                "ურანი მზიდან მეშვიდე პლანეტა დაშორების მიხედვით. ის რადიუსით მესამე, ხოლო მასით მეოთხეა მზის სისტემაში. ურანის შედგენილობა ნეპტუნისას ჰგავს, ხოლო ეს ორი პლანეტა გაზური გიგანტებისგან, იუპიტერისა და სატურნისგან განსხვავებულია, ამიტომაც ასტრონომები ურანსა და ნეპტუნს განცალკევებულ კატეგორიაში — „ყინულის გიგანტებში“ მოიხსენიებენ. მიუხედავად იმისა, რომ ურანის ატმოსფერო წყალბადისა და ჰელიუმის ძირითადი შედგენილობით სატურნსა და იუპიტერს წააგავს, ის შეიცავს უფრო მეტ „ყინულს“, როგორებიცაა ამიაკი და მეთანი, სხვა ჰიდროკარბონებთან ერთად. მისი ატმოსფერო ყველაზე ცივია მზის სისტემაში ტემპერატურით −224,2 °C. ურანის ატმოსფეროს რთულ ფენებიანი ღრუბლის სტრუქტურა აქვს და მეცნიერთა ვარაუდით, მის ძირეულ ღრუბლებში წყალია, ხოლო ყველაზე მაღალ ღრუბლებში — მეთანი.[6] ამის საპირისპიროდ, ურანის შიდა ნაწილები ძირითადად გაჯერებულია ყინულითა და ქვით."
            )
        )
        Planetlist.add(
            PlanetData(
                7,
                "მზე",
                "ირმის ნახტომი",
                "0",
                "274.0",
                "მზე მზის სისტემის ცენტრში მდებარე ერთადერთი ვარსკვლავია. ის თითქმის იდეალურად სფერულია და შედგება ცხელი პლაზმისგან, რომელშიც ჩაქსოვილია მაგნიტური ველები. მისი მასა მზის სისტემის მთლიანი მასის 99,86%-ს მოიცავს. ქიმიურად, მზის მასის 3/4-ს წყალბადი შეადგენს, ხოლო დანარჩენი უმეტესად ჰელიუმია. დარჩენილი 1,69% (რომელიც დედამიწის მასას 5600-ჯერ აღემატება) მოიცავს მძიმე ელემენტებს, როგორებიცაა: ჟანგბადი, ნახშირბადი, ნეონი, რკინა და სხვა.\n ერთ დროს ასტრონომები მზეს პატარა და შედარებით შეუმჩნეველ ვარსკვლავად აღიქვამდნენ, მაგრამ ახლა მიჩნეულია, რომ იგი ირმის ნახტომში არსებული ვარსკვლავების 85%-ზე კაშკაშაა, რომელთა უმეტესობა წითელი ჯუჯებია. მზის გავარვარებული გვირგვინი უწყვეტად ფართოვდება და ქმნის მზიურ ქარს — დამუხტული ნაწილაკების ნაკადი, რომელიც ფართოვდება ჰელიოპაუზამდე, 100 ასტრონომიული ერთეულის მანძილზე. ჰელიოსფერო, რომელიც ვარსკვლავთშორის სივრცეში მზიურმა ქარმა წარმოქმნა, არის უდიდესი უწყვეტი სტრუქტურა მზის სისტემაში."
            )
        )
        Planetlist.add(
            PlanetData(
                8,
                "სატურნი",
                "ირმის ნახტომი",
                "1427.0",
                "10.44",
                "სატურნი სიშორით მეექვსე პლანეტაა მზიდან. ეს გაზის გიგანტი სიდიდით მეორე პლანეტაა მზის სისტემაში იუპიტერის შემდეგ. პლანეტას რომაული ღმერთი სატურნის სახელი ჰქვია. მისი სიმბოლოა ღმერთის კვერთხის სტილიზებული რეპრეზენტაცია - ♄.\n სატურნის პირველი ფოტოსურათი პიონერ 11 -მა 1979 წლის სექტემბერში გადაიღო 20 000 კმ-ის მანძილიდან. მაშინ აგრეთვე მისი რამდენიმე თანამგზავრი აღმოაჩინა და სურათები გადაუღო. ნასას 2016 წლის მონაცემებით სატურნს 82 თანამგზავრი ჰყავს, მათ შორის ყველაზე დიდია ტიტანი. სატურნის ატმოსფეროს 96,3 % წყალბადისგან შედგება, 3,25 % ჰელიუმისგან, დანარჩენი 0,45 % სხვა აირებია."
            )
        )
        Planetlist.add(
            PlanetData(
                9,
                "იუპიტერი",
                "ირმის ნახტომი",
                "778.3",
                "24.79",
                "იუპიტერი მეხუთე პლანეტა მზიდან დაშორებით და მზის სისტემის უდიდესი ციური სხეული. პლანეტა ცნობილია ანტიკური ხანიდან და სახელწოდება მომდინარეობს ძველი რომაული ღვთაება იუპიტერიდან. ის მიეკუთვნება გაზის გიგანტების ტიპის პლანეტას.\n იუპიტერი სიკაშკაშით მეოთხე სხეულია ცაზე (მზის, მთვარისა და ვენერას შემდეგ), თუმცა შიგადაშიგ მარსი იუპიტერზე უფრო მკვეთრად ჩანს. იუპიტერი მზის სისტემის უდიდესი პლანეტაა. მისი ეკვატორული დიამეტრი 142 900 კმ–ია, პოლარული დიამეტრი 133 700 კმ-ია, რაც დაახლოებით 11.2–ჯერ აღემატება დედამიწის ანალოგიურ მაჩვენებლებს.\n იუპიტერზე ავტომატური ხელოვნური თანამგზავრების მისიები დაიწყეს 1973 წლის 3 დეკემბრიდან.\n იუპიტერის ატმოსფეროს ძირითადი შემადგენელი ელემენტებია: წყალბადი (75 % – მასის მიხედვით) და ჰელიუმი (24 % – მასის მიხედვით). აგრეთვე ატმოსფეროს შემადგენლობაშია მეთანი, ამიაკი და წყლის ორთქლი. ატმოსფეროს გარე ფენები შეიცავენ გაყინული ამიაკის კრისტალებს. პლანეტის მოწითალო ფერს განაპირობებს ფოსფორის, გოგირდის და ნახშირბადის არსებობა. ღრუბელთა გარე ფენების ტემპერატურა დაახლოებით −130 °С–ია, თუმცა სიღრმეში სწრაფად იზრდება. აპარატ „გალილეოს“ მონაცემებით, 130 კმ სიღრმეზე ტემპერატურა +150 °С–ს უახლოვდება, წნევა კი — 24 ატმოსფეროს."
            )
        )
        Planetlist.add(
            PlanetData(
                10,
                "მერკური",
                "ირმის ნახტომი",
                "57.9",
                "3.7",
                "მერკური მზესთან ყველაზე ახლოს მდებარე პლანეტა. ის ასევე ყველაზე პატარაა და მისი ორბიტა ყველაზე ექსცენტრიულია მთელ რვა პლანეტას შორის. მისი ორბიტალური პერიოდი 88 დღეს გრძელდება (დედამიწის დღე). როდესაც ორჯერ დაასრულებს ორბიტალურ პერიოდს, მერკური ღერძის გარშემო ორჯერ შემობრუნდება. პლანეტას რომაული ღმერთის - მერკურის სახელწოდება აქვს. მერკური ღმერთების შიკრიკი, მედიატორი იყო.\n მერკურის ზედაპირი ძალიან კრატერიანია და გარეგნობით დედამიწის მთვარეს ძალიან ჰგავს. ეს კი იმაზე მიუთითებს, რომ მერკური მილიარდობით წლების განმავლობაში გეოლოგიურად არააქტიური იყო. რადგანაც მერკურის თითქმის არ აქვს ატმოსფერო, რომ სითბო შეინარჩუნოს, მისი ზედაპირი ექსტრემალურ ტემპერატურულ ცვლილებებს იტანს - ღამით -173.15 °C და დღისით 426.85 °C. მერკურის ღერძი ყველა პლანეტის ღერძზე დახრილია, მაგრამ მისი ორბიტალური ექსცენტრისიტეტი უდიდესია. პლანეტაზე სეზონის ცვალებადობა უფრო დამოკიდებულია მისი მზიდან დაშორებაზე, ვიდრე პლანეტის ღერძის დახრილობაზე, რომელიც დედამიწაზე და სხვა პლანეტებზე სეზონის ცვალებადობის ძირითადი გამომწვევი მიზეზია. ამის გამო, სეზონები ერთმანეთისგან არ განსხვავდებიან არც ერთ ნახევარსფეროზე, ანუ პლანეტის ყველა წერტილში ერთი სეზონია."
            )
        )
        return Planetlist
    }
}